/*
В усіх мовах програмування для розгалуження програми, по замовчуванню, використовуються if/ else if/ else оператори, синтаксис котрих в JS має такий вигляд:
    if (умова) {код}
    else if (умова) {код}
    else {код}

Також з цією ж ціллю існує тернарний оператор, котрий виконує звичайне if/else розгалуження, просто є кращою його версією і має такий синтаксис:
    (умова) ? код, якщо умова здійснюється : код, якщо умова не здійснюється;
*/

if (10<1) {
    alert('Якщо перша умова виконалась (10<1)');
}
else if (10>100) {
    alert('Якщо друга умова виконалась (10>100)')
}
else {
    alert('Якщо жодна з попередніх умов не виконалась')
}

isTrue = (10>1) ? true : false;
alert(isTrue)