/*
    if (ВИРАЗ_1 === ВИРАЗ_2) {     - Якщо ВИРАЗ_1 рівний(===) ВИРАЗУ_2, то виконується код, що іде у наступних {цих} дужках.
        КОД
    }
    else if (ВИРАЗ_3 === ВИРАЗ_4) { - Якщо ВИРАЗ_3 рівний(===) ВИРАЗУ_4, то виконується код, що іде у наступних {цих} дужках.
        КОД
    }
    else {  - У всіх інших випадках буде виконуватись той код, що буде іти у наступних після else дужках
        КОД
    }
*/

myVar1 = 10

document.querySelector('input').onclick() = function () {
    myVar2 = document.getElementsById('myValue').values;
    if (myVar2 === 'Слова') {
        alert('myVar2 - це "Слова"');
    }
    else if (myVar2 === 'Слова - це слова!') {
        alert('myVar2 - "Слова - це слова!"');
    }
    else {
        alert('Я без поняття, що за myVar2! :P');
    }
}

if (myVar1 === 100) {
    alert('myVar1 рівне 100');
} else {
    alert('myVar1 не рівне 100');
}