/*
Оператори порівняння:
    <ел1> > <ел2> - елемент 1 більший за елемент 2
    <ел1> < <ел2> - елемент 1 менший за елемент 2
    <ел1> >= - елемент 1 більший або рівний елементу 2
    <ел1> <= <ел2> - елемент 1 менший або рівний елементу 2

    <ел1> == <ел2> - нежорстке порівняння на рівність
    <ел1> === <ел2> - жорстке порівняння на рівність
    <ел1> != <ел2> - нежорстке порівняння на нерівність
    <ел1> !== <ел2> - жорстке порівняння на нерівність

    <ел1> != <ел2> || <ел2> != <ел3> - логічне АБО (true при умові1 АБО умові2)
    <ел1> != <ел2> && <ел2> != <ел3> - логічне ТА (true при умові1 ТА умові2)
    !<ел1> == <ел2> - логічне НЕ (НЕ(<умова1>) == (<умова2>))
*/

alert(10 > 100) // false на виході
alert('5' == 5) // true на виході
alert('5' === 5)// false на виході
alert('5' != 5)// false на виході
alert('5' !== 5)// true на виході

alert('5' == '3' || 5 == '10')// false на виході
alert('5' == '3' && 10 == '10')// false на виході
alert(!('5' == '3') && 10 == '10')// true на виході